GopalSaraf/Practicals/PSDL/include/proc/pic18f6390.inc
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
LCDDATA15                                equ 0F74h
// bitfield definitions
LCDDATA15_LCDDATA15_POSN                 equ 0000h
LCDDATA15_LCDDATA15_POSITION             equ 0000h
LCDDATA15_LCDDATA15_SIZE                 equ 0008h
LCDDATA15_LCDDATA15_LENGTH               equ 0008h
LCDDATA15_LCDDATA15_MASK                 equ 00FFh
LCDDATA15_S24C2_POSN                     equ 0000h
LCDDATA15_S24C2_POSITION                 equ 0000h
LCDDATA15_S24C2_SIZE                     equ 0001h
LCDDATA15_S24C2_LENGTH                   equ 0001h
LCDDATA15_S24C2_MASK                     equ 0001h
LCDDATA15_S25C2_POSN                     equ 0001h
LCDDATA15_S25C2_POSITION                 equ 0001h
LCDDATA15_S25C2_SIZE                     equ 0001h
LCDDATA15_S25C2_LENGTH                   equ 0001h
LCDDATA15_S25C2_MASK                     equ 0002h
LCDDATA15_S26C2_POSN                     equ 0002h
LCDDATA15_S26C2_POSITION                 equ 0002h
LCDDATA15_S26C2_SIZE                     equ 0001h
LCDDATA15_S26C2_LENGTH                   equ 0001h
LCDDATA15_S26C2_MASK                     equ 0004h
LCDDATA15_S27C2_POSN                     equ 0003h
LCDDATA15_S27C2_POSITION                 equ 0003h
LCDDATA15_S27C2_SIZE                     equ 0001h
LCDDATA15_S27C2_LENGTH                   equ 0001h
LCDDATA15_S27C2_MASK                     equ 0008h
LCDDATA15_S28C2_POSN                     equ 0004h
LCDDATA15_S28C2_POSITION                 equ 0004h
LCDDATA15_S28C2_SIZE                     equ 0001h
LCDDATA15_S28C2_LENGTH                   equ 0001h
LCDDATA15_S28C2_MASK                     equ 0010h
LCDDATA15_S29C2_POSN                     equ 0005h
LCDDATA15_S29C2_POSITION                 equ 0005h
LCDDATA15_S29C2_SIZE                     equ 0001h
LCDDATA15_S29C2_LENGTH                   equ 0001h
LCDDATA15_S29C2_MASK                     equ 0020h
LCDDATA15_S30C2_POSN                     equ 0006h
LCDDATA15_S30C2_POSITION                 equ 0006h
LCDDATA15_S30C2_SIZE                     equ 0001h
LCDDATA15_S30C2_LENGTH                   equ 0001h
LCDDATA15_S30C2_MASK                     equ 0040h
LCDDATA15_S31C2_POSN                     equ 0007h
LCDDATA15_S31C2_POSITION                 equ 0007h
LCDDATA15_S31C2_SIZE                     equ 0001h
LCDDATA15_S31C2_LENGTH                   equ 0001h
LCDDATA15_S31C2_MASK                     equ 0080h
LCDDATA15_SEG24COM2_POSN                 equ 0000h
LCDDATA15_SEG24COM2_POSITION             equ 0000h
LCDDATA15_SEG24COM2_SIZE                 equ 0001h
LCDDATA15_SEG24COM2_LENGTH               equ 0001h
LCDDATA15_SEG24COM2_MASK                 equ 0001h
LCDDATA15_SEG25COM2_POSN                 equ 0001h
LCDDATA15_SEG25COM2_POSITION             equ 0001h
LCDDATA15_SEG25COM2_SIZE                 equ 0001h
LCDDATA15_SEG25COM2_LENGTH               equ 0001h
LCDDATA15_SEG25COM2_MASK                 equ 0002h
LCDDATA15_SEG26COM2_POSN                 equ 0002h
LCDDATA15_SEG26COM2_POSITION             equ 0002h
LCDDATA15_SEG26COM2_SIZE                 equ 0001h
LCDDATA15_SEG26COM2_LENGTH               equ 0001h
LCDDATA15_SEG26COM2_MASK                 equ 0004h
LCDDATA15_SEG27COM2_POSN                 equ 0003h
LCDDATA15_SEG27COM2_POSITION             equ 0003h
LCDDATA15_SEG27COM2_SIZE                 equ 0001h
LCDDATA15_SEG27COM2_LENGTH               equ 0001h
LCDDATA15_SEG27COM2_MASK                 equ 0008h
LCDDATA15_SEG28COM2_POSN                 equ 0004h
LCDDATA15_SEG28COM2_POSITION             equ 0004h
LCDDATA15_SEG28COM2_SIZE                 equ 0001h
LCDDATA15_SEG28COM2_LENGTH               equ 0001h
LCDDATA15_SEG28COM2_MASK                 equ 0010h
LCDDATA15_SEG29COM2_POSN                 equ 0005h
LCDDATA15_SEG29COM2_POSITION             equ 0005h
LCDDATA15_SEG29COM2_SIZE                 equ 0001h
LCDDATA15_SEG29COM2_LENGTH               equ 0001h
LCDDATA15_SEG29COM2_MASK                 equ 0020h
LCDDATA15_SEG30COM2_POSN                 equ 0006h
LCDDATA15_SEG30COM2_POSITION             equ 0006h
LCDDATA15_SEG30COM2_SIZE                 equ 0001h
LCDDATA15_SEG30COM2_LENGTH               equ 0001h
LCDDATA15_SEG30COM2_MASK                 equ 0040h
LCDDATA15_SEG31COM2_POSN                 equ 0007h
LCDDATA15_SEG31COM2_POSITION             equ 0007h
LCDDATA15_SEG31COM2_SIZE                 equ 0001h
LCDDATA15_SEG31COM2_LENGTH               equ 0001h
LCDDATA15_SEG31COM2_MASK                 equ 0080h

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
LCDDATA16                                equ 0F75h
// bitfield definitions
LCDDATA16_LCDDATA16_POSN                 equ 0000h
LCDDATA16_LCDDATA16_POSITION             equ 0000h
LCDDATA16_LCDDATA16_SIZE                 equ 0008h
LCDDATA16_LCDDATA16_LENGTH               equ 0008h
LCDDATA16_LCDDATA16_MASK                 equ 00FFh
LCDDATA16_S32C2_POSN                     equ 0000h
LCDDATA16_S32C2_POSITION                 equ 0000h
LCDDATA16_S32C2_SIZE                     equ 0001h
LCDDATA16_S32C2_LENGTH                   equ 0001h
LCDDATA16_S32C2_MASK                     equ 0001h
LCDDATA16_S33C2_POSN                     equ 0001h
LCDDATA16_S33C2_POSITION                 equ 0001h
LCDDATA16_S33C2_SIZE                     equ 0001h
LCDDATA16_S33C2_LENGTH                   equ 0001h
LCDDATA16_S33C2_MASK                     equ 0002h
LCDDATA16_S34C2_POSN                     equ 0002h
LCDDATA16_S34C2_POSITION                 equ 0002h
LCDDATA16_S34C2_SIZE                     equ 0001h
LCDDATA16_S34C2_LENGTH                   equ 0001h
LCDDATA16_S34C2_MASK                     equ 0004h
LCDDATA16_S35C2_POSN                     equ 0003h
LCDDATA16_S35C2_POSITION                 equ 0003h
LCDDATA16_S35C2_SIZE                     equ 0001h
LCDDATA16_S35C2_LENGTH                   equ 0001h
LCDDATA16_S35C2_MASK                     equ 0008h
LCDDATA16_S36C2_POSN                     equ 0004h
LCDDATA16_S36C2_POSITION                 equ 0004h
LCDDATA16_S36C2_SIZE                     equ 0001h
LCDDATA16_S36C2_LENGTH                   equ 0001h
LCDDATA16_S36C2_MASK                     equ 0010h
LCDDATA16_S37C2_POSN                     equ 0005h
LCDDATA16_S37C2_POSITION                 equ 0005h
LCDDATA16_S37C2_SIZE                     equ 0001h
LCDDATA16_S37C2_LENGTH                   equ 0001h
LCDDATA16_S37C2_MASK                     equ 0020h
LCDDATA16_S38C2_POSN                     equ 0006h
LCDDATA16_S38C2_POSITION                 equ 0006h
LCDDATA16_S38C2_SIZE                     equ 0001h
LCDDATA16_S38C2_LENGTH                   equ 0001h
LCDDATA16_S38C2_MASK                     equ 0040h
LCDDATA16_S39C2_POSN                     equ 0007h
LCDDATA16_S39C2_POSITION                 equ 0007h
LCDDATA16_S39C2_SIZE                     equ 0001h
LCDDATA16_S39C2_LENGTH                   equ 0001h
LCDDATA16_S39C2_MASK                     equ 0080h
LCDDATA16_SEG32COM2_POSN                 equ 0000h
LCDDATA16_SEG32COM2_POSITION             equ 0000h
LCDDATA16_SEG32COM2_SIZE                 equ 0001h
LCDDATA16_SEG32COM2_LENGTH               equ 0001h
LCDDATA16_SEG32COM2_MASK                 equ 0001h
LCDDATA16_SEG33COM2_POSN                 equ 0001h
LCDDATA16_SEG33COM2_POSITION             equ 0001h
LCDDATA16_SEG33COM2_SIZE                 equ 0001h
LCDDATA16_SEG33COM2_LENGTH               equ 0001h
LCDDATA16_SEG33COM2_MASK                 equ 0002h
LCDDATA16_SEG34COM2_POSN                 equ 0002h
LCDDATA16_SEG34COM2_POSITION             equ 0002h
LCDDATA16_SEG34COM2_SIZE                 equ 0001h
LCDDATA16_SEG34COM2_LENGTH               equ 0001h
LCDDATA16_SEG34COM2_MASK                 equ 0004h
LCDDATA16_SEG35COM2_POSN                 equ 0003h
LCDDATA16_SEG35COM2_POSITION             equ 0003h
LCDDATA16_SEG35COM2_SIZE                 equ 0001h
LCDDATA16_SEG35COM2_LENGTH               equ 0001h
LCDDATA16_SEG35COM2_MASK                 equ 0008h
LCDDATA16_SEG36COM2_POSN                 equ 0004h
LCDDATA16_SEG36COM2_POSITION             equ 0004h
LCDDATA16_SEG36COM2_SIZE                 equ 0001h
LCDDATA16_SEG36COM2_LENGTH               equ 0001h
LCDDATA16_SEG36COM2_MASK                 equ 0010h
LCDDATA16_SEG37COM2_POSN                 equ 0005h
LCDDATA16_SEG37COM2_POSITION             equ 0005h
LCDDATA16_SEG37COM2_SIZE                 equ 0001h
LCDDATA16_SEG37COM2_LENGTH               equ 0001h
LCDDATA16_SEG37COM2_MASK                 equ 0020h
LCDDATA16_SEG38COM2_POSN                 equ 0006h
LCDDATA16_SEG38COM2_POSITION             equ 0006h
LCDDATA16_SEG38COM2_SIZE                 equ 0001h
LCDDATA16_SEG38COM2_LENGTH               equ 0001h
LCDDATA16_SEG38COM2_MASK                 equ 0040h
LCDDATA16_SEG39COM2_POSN                 equ 0007h
LCDDATA16_SEG39COM2_POSITION             equ 0007h
LCDDATA16_SEG39COM2_SIZE                 equ 0001h
LCDDATA16_SEG39COM2_LENGTH               equ 0001h
LCDDATA16_SEG39COM2_MASK                 equ 0080h
LCDDATA16_T4CKPS016_POSN                 equ 0000h
LCDDATA16_T4CKPS016_POSITION             equ 0000h
LCDDATA16_T4CKPS016_SIZE                 equ 0001h
LCDDATA16_T4CKPS016_LENGTH               equ 0001h
LCDDATA16_T4CKPS016_MASK                 equ 0001h
LCDDATA16_T4CKPS116_POSN                 equ 0001h
LCDDATA16_T4CKPS116_POSITION             equ 0001h
LCDDATA16_T4CKPS116_SIZE                 equ 0001h
LCDDATA16_T4CKPS116_LENGTH               equ 0001h
LCDDATA16_T4CKPS116_MASK                 equ 0002h
LCDDATA16_T4OUTPS016_POSN                equ 0003h
LCDDATA16_T4OUTPS016_POSITION            equ 0003h
LCDDATA16_T4OUTPS016_SIZE                equ 0001h
LCDDATA16_T4OUTPS016_LENGTH              equ 0001h
LCDDATA16_T4OUTPS016_MASK                equ 0008h
LCDDATA16_T4OUTPS116_POSN                equ 0004h
LCDDATA16_T4OUTPS116_POSITION            equ 0004h
LCDDATA16_T4OUTPS116_SIZE                equ 0001h
LCDDATA16_T4OUTPS116_LENGTH              equ 0001h
LCDDATA16_T4OUTPS116_MASK                equ 0010h
LCDDATA16_T4OUTPS216_POSN                equ 0005h
LCDDATA16_T4OUTPS216_POSITION            equ 0005h
LCDDATA16_T4OUTPS216_SIZE                equ 0001h
LCDDATA16_T4OUTPS216_LENGTH              equ 0001h
LCDDATA16_T4OUTPS216_MASK                equ 0020h
LCDDATA16_T4OUTPS316_POSN                equ 0006h
LCDDATA16_T4OUTPS316_POSITION            equ 0006h
LCDDATA16_T4OUTPS316_SIZE                equ 0001h
LCDDATA16_T4OUTPS316_LENGTH              equ 0001h
LCDDATA16_T4OUTPS316_MASK                equ 0040h

